---
kind: type
id: T:Autodesk.Revit.DB.Visual.NoiseType
source: html/29794f15-9847-640a-055e-be4a4d5f54ff.htm
---
# Autodesk.Revit.DB.Visual.NoiseType

The enumerated type representing the permitted values for the asset property "NoiseType" from the "Noise" schema.

## Syntax (C#)
```csharp
public enum NoiseType
```